katest.ЕТС_Кастомизация/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="351b0c5b-74c3-4aaa-a93b-7246b941f797">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="8880d304-daf7-4345-ad8d-c81bc5d994b7">
    <name>РеализацияЧерезКомиссионера</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4dec627e-3939-4191-a213-0cea734fc86c">
    <name>РеализацияКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f24e8e16-21ad-4eeb-a73d-06152c4d9a1e">
    <name>РеализацияЧерезКомиссионераБезПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a606d3e5-4a59-4b2c-9d3d-5976f5c778cf">
    <name>ПередачаНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3299776f-a304-476e-a0d9-a9132b128869">
    <name>РеализацияКлиентуРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0789d7c2-8020-4d52-a305-445f9faa9b76">
    <name>РеализацияБезПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d0ea89d0-cb52-4ba9-95f0-c511b85739dc">
    <name>ОформлениеГТДБрокером</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6ca99773-897c-437c-a307-54d51b8d9a9c">
    <name>ОформлениеГТДСамостоятельно</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

katest.ЕТС_Кастомизация/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="492f859c-898a-4672-ab31-9d0ca13acabc">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="5df46640-a48c-42a3-84ec-3c9f97ce2844">
    <name>ПродажаНеОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="507f3953-94e1-46ef-8c8d-0688fd890a1d">
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9f70eac4-2b8c-4400-9fb7-f3d4230ad33e">
    <name>ПродажаНаЭкспорт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1270ac55-6965-4dae-b63b-1266cf1cca2a">
    <name>ПродажаОблагаетсяЕНВД</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

katest.ЕТС_Кастомизация/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e84f811f-b8c6-4c9c-9e98-f10ab90f1702">
  <name>СпособыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="066e8fb0-3813-4481-b4bf-edfafab4aed9">
    <name>СиламиПеревозчикаПоАдресу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f442a653-b32b-4be9-9b5e-4a5abb206d85">
    <name>Самовывоз</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3c09e30d-ef7d-4e10-9b7e-c3d470857e36">
    <name>ДоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b983ffd7-6fee-4341-823c-bc970e783c64">
    <name>СиламиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c07693f6-6c15-46b9-8ea5-6560cf995152">
    <name>КПолучателюОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

katest.ЕТС_Кастомизация/src/Enums/НазначенияВидовЦен/НазначенияВидовЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="a9ca2751-8948-4117-ac10-4783f81777fb">
  <name>НазначенияВидовЦен</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="18f357ad-6bc6-4712-b061-9ce5e4856974">
    <name>ИндивидуальныйДляСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2fa9e530-b9af-4e6e-b5f4-671091fb92e3">
    <name>ИндивидуальныйДляПартнера</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9b30f3a2-995f-4e35-8586-5c4d42bcc318">
    <name>ИндивидуальныйДляСоглашения</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="dfbf5ed2-8323-46a6-9956-6d290d87e428">
    <name>Общий</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="64bccfc6-47c4-44f4-be0b-5763cdb15f9a">
    <name>ИндивидуальныйДляФорматаМагазинов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

katest.ЕТС_Кастомизация/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1ceef4a2-6b58-45a0-8a75-bb6e3004590f">
  <name>ЗаказКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="b6951ae3-bd6b-4547-a0ed-f8cb252badb3">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a8d06692-73f7-469f-a6a7-388a13d421d2">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1a14d675-c2a2-4a16-978c-9044aa42660a">
    <name>СуммаПредоплатыДоОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="75bf369d-e0ba-4ded-a392-7292f757e439">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3c728d38-3039-41f6-b288-2b92f32630c3">
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1c757d5d-0c97-4216-8b3f-90737b1b485f">
    <name>ДатаПоДаннымКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0a1a3da1-943d-49ab-9c34-a8ed2e386612">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c683aebd-f890-44bb-bbe3-b67f7e95b55b">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3d68151c-a9dd-450f-8139-3be6ac926f58">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1974cb5e-5162-4f59-90ce-866449e6abe0">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d462888a-fa46-4e10-842a-8647c5c2ab42">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4ff8b2cf-1c36-4154-b5e4-fbc8a3ba5ea5">
    <name>СуммаАвансаДоОбеспечения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9b03f67d-2b7d-4c73-a988-943a154dbef7">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="09d5679e-99d4-4bae-a2be-ab43f7ffaaae">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e1db6dac-b3bd-439d-b32b-faf174bb385a">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="435746b1-202f-40da-adae-b8569d4b81e8">
    <name>СуммаВозвратнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e925be7d-2573-499a-98d3-d4083edd7cb4">
    <name>ГрафикОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="21767e3f-5e9d-43d3-803c-eaf6279e10db">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="872dcece-786c-416e-bfa4-4ce98df56dd6">
    <name>НомерПоДаннымКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2261fcc3-938d-4df2-a64b-de5601c36355">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c52d49cc-c442-472e-9894-2b37fc9463d8">
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

katest.ЕТС_Кастомизация/src/CommonModules/ЕТС_ОбменССайтом/Module.bsl
Процедура ПолучитьЗаказыССайта() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОсновнаяНастройкаОбмена = Справочники.ЕТС_НастройкаОбменаССайтом.НастройкаОбменаССайтом;
	НастройкаОбмена = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОсновнаяНастройкаОбмена,"ОбменРазрешен,СтрокаПодключения,КлючПодключения");
	Если Не НастройкаОбмена.ОбменРазрешен Тогда
		Сообщить("Обмен не разрешен.");
		Возврат;
	КонецЕсли; 
	
	СтрокаПодключения = СокрЛП(НастройкаОбмена.СтрокаПодключения);
	КлючПодключения = СокрЛП(НастройкаОбмена.КлючПодключения);
	Если Не ЗначениеЗаполнено(СтрокаПодключения) Или Не ЗначениеЗаполнено(КлючПодключения) Тогда
		Сообщить("Заполните в настройках строку и ключ подключения для обмена с сайтом");
		Возврат;
	КонецЕсли; 
	СерверИсточник = СтрокаПодключения + "orders" + "?key="  + КлючПодключения;
	//Получим дату последнего документа "КоммерческоеПредложениеКлиенту". Начиная с этой даты будем получать заказы
	//Если заказов еще нет, тогда будем использовать дату указанную в настройках
	//Если и там нет ничего, тогда начало тек дня
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказКлиента.Дата КАК Дата
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ДатаЗапроса = РезультатЗапроса.Выгрузить()[0].Дата;
	Иначе                                           
		//ДатаЗапроса = НастройкаОбмена.ДатаНачала;
		Если Не ЗначениеЗаполнено(ДатаЗапроса) Тогда
			ДатаЗапроса = НачалоДня(ТекущаяДата());
		КонецЕсли; 
	КонецЕсли; 
	
	//Строка с датой запроса должна иметь вид 06.06.2012%2010:47:45.Это приравневается дате 06.06.2012 10.47.45
	СтрокаДатаНачалаЗапроса = Формат(ДатаЗапроса,"ДФ=dd.MM.yyyy") + "%20" + Формат(ДатаЗапроса,"ДФ=ЧЧ.мм.сс"); 
	СерверИсточник = СерверИсточник + "&last_date=" + СтрокаДатаНачалаЗапроса; 
	
	//Идет HTTP запрос, на выходе получаем xml файл, который содержит новые заказы
	HTTP = Новый HTTPСоединение(СерверИсточник);
	
	// !!!!!!!!!!!!!! 
	//ИмяВходящегоФайла = КаталогВременныхФайлов() + "order.xml";
	ИмяВходящегоФайла = КаталогВременныхФайлов() + Формат(ТекущаяДата(), "ггггММддЧЧммсс") + "order.xml";
	
	Попытка
		HTTP.Получить("",ИмяВходящегоФайла);
	Исключение
		Сообщить("Ошибка работы с Интернет");
	    Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	//Разбор xml и создание заказов
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.ОткрытьФайл(ИмяВходящегоФайла);
	ПостроительDOM = Новый ПостроительDOM();
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);          
	ЧтениеXML.Закрыть();
	
	//Сформируем структуру шапки заказа
	ТаблицаШапкиЗаказов = Новый ТаблицаЗначений;
	ТаблицаШапкиЗаказов.Колонки.Добавить("Номер");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ДатаХраненияЗаказаНаСайте");
	ТаблицаШапкиЗаказов.Колонки.Добавить("СтрокаДатаХраненияЗаказаНаСайте");
	ТаблицаШапкиЗаказов.Колонки.Добавить("Комментарий");
	ТаблицаШапкиЗаказов.Колонки.Добавить("Email");
	ТаблицаШапкиЗаказов.Колонки.Добавить("Логин");
	ТаблицаШапкиЗаказов.Колонки.Добавить("Фамилия");
	ТаблицаШапкиЗаказов.Колонки.Добавить("Имя");
	ТаблицаШапкиЗаказов.Колонки.Добавить("Отчество");
	ТаблицаШапкиЗаказов.Колонки.Добавить("Телефон");
	ТаблицаШапкиЗаказов.Колонки.Добавить("КонтактныйТелефон");
	ТаблицаШапкиЗаказов.Колонки.Добавить("Skype");
	ТаблицаШапкиЗаказов.Колонки.Добавить("Icq");
	ТаблицаШапкиЗаказов.Колонки.Добавить("Компания");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ТипКомпании");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ИНН");
	ТаблицаШапкиЗаказов.Колонки.Добавить("КПП");
	ТаблицаШапкиЗаказов.Колонки.Добавить("Банк");
	ТаблицаШапкиЗаказов.Колонки.Добавить("БИК");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ГородБанка");
	ТаблицаШапкиЗаказов.Колонки.Добавить("НомерСчета");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ЮрСтрана");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ЮрРегион");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ЮрГород");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ЮрУлица");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ЮрДом");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ЮрКорпус");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ЮрКвартира");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ФактСтрана");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ФактРегион");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ФактГород");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ФактУлица");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ФактДом");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ФактКорпус");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ФактКвартира");
	ТаблицаШапкиЗаказов.Колонки.Добавить("Грузополучатель");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ГрузополучательТип");	
	ТаблицаШапкиЗаказов.Колонки.Добавить("ГрузополучательИНН");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ГрузополучательКПП");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ГрузополучательБанк");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ГрузополучательБИК");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ГрузополучательГородБанка");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ГрузополучательНомерСчета");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ГрузополучательСтрана");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ГрузополучательРегион");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ГрузополучательГород");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ГрузополучательУлица");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ГрузополучательДом");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ГрузополучательКорпус");
	ТаблицаШапкиЗаказов.Колонки.Добавить("ГрузополучательКвартира");
	ТаблицаШапкиЗаказов.Колонки.Добавить("Менеджер");
	ТаблицаШапкиЗаказов.Колонки.Добавить("Товары");
	//ЛВГ
	ТаблицаШапкиЗаказов.Колонки.Добавить("ПодразделениеКомпании");
	//ЛВГ
	//ЛВГ+++ поиск контрагента по коду, а не по кпп инн 18.04.2019
	ТаблицаШапкиЗаказов.Колонки.Добавить("ЦБКонтрагента");
	//ЛВГ---
	
	//Заказы храняться в элементах с именем "Order"
	СписокЭлементовЗаказов = ДокументDOM.ПолучитьЭлементыПоИмени("order");
	Для Каждого ЭлементЗаказ Из СписокЭлементовЗаказов Цикл
		
		НоваяСтрока = ТаблицаШапкиЗаказов.Добавить();
		
		КоллекцияАтрибутовЗаказа = ЭлементЗаказ.Атрибуты;
		НоваяСтрока.Номер = КоллекцияАтрибутовЗаказа.ПолучитьИменованныйЭлемент("id").Значение;
		ДатаЗаказа = ПолучитьЗначениеПоИмени(ЭлементЗаказ,"created_at");
		НоваяСтрока.СтрокаДатаХраненияЗаказаНаСайте = ДатаЗаказа;
		//Вычленим дату из строки
		__Год = Сред(ДатаЗаказа,1,4);
		__Месяц = Сред(ДатаЗаказа,6,2);
		__День = Сред(ДатаЗаказа,9,2);
		__Час =  Сред(ДатаЗаказа,12,2);
		__Мин =  Сред(ДатаЗаказа,15,2);
		__Сек =  Сред(ДатаЗаказа,18,2);
		//На сайте дата хранится с разницей по часовым поясам
		//Узнаем что нам делать с датой сайта
		ВычитатьЧасы = Ложь;
		Если Сред(ДатаЗаказа,21,1) = "+" Тогда
			ВычитатьЧасы = Истина;
		КонецЕсли; 
		__РазницаЧасов = Число(Сред(ДатаЗаказа,22,2));
		__РазницаМинут = Число(Сред(ДатаЗаказа,24,2));
		
		Если ВычитатьЧасы Тогда
			НоваяСтрока.ДатаХраненияЗаказаНаСайте = Дата(__Год,__Месяц,__День,__Час,__Мин,__Сек) - (60*60*__РазницаЧасов + 60*__РазницаМинут);
		Иначе 
			НоваяСтрока.ДатаХраненияЗаказаНаСайте = Дата(__Год,__Месяц,__День,__Час,__Мин,__Сек) + (60*60*__РазницаЧасов + 60*__РазницаМинут);
		КонецЕсли; 
		
		//получим данные по комментарию к заказу
		НоваяСтрока.Комментарий = ПолучитьЗначениеПоИмени(ЭлементЗаказ,"comment");
		
		//получим данные по клиенту
		НоваяСтрока.Email = ПолучитьЗначениеПоИмени(ЭлементЗаказ,"email");
		НоваяСтрока.Логин = ПолучитьЗначениеПоИмени(ЭлементЗаказ,"login");
		НоваяСтрока.Фамилия = ПолучитьЗначениеПоИмени(ЭлементЗаказ,"family_name");
		НоваяСтрока.Имя = ПолучитьЗначениеПоИмени(ЭлементЗаказ,"name");
		НоваяСтрока.Отчество = ПолучитьЗначениеПоИмени(ЭлементЗаказ,"second_name");
		//Данные по менеджеру
		КодМенеджера = ПолучитьЗначениеПоИмени(ЭлементЗаказ,"manager_id");
		//НоваяСтрока.Менеджер = Справочники.Сотрудники.НайтиПоКоду(СокрЛП(КодМенеджера), Истина);
		НоваяСтрока.Менеджер = ПолучитьЗначениеПоИмени(ЭлементЗаказ,"manager_id"); 
		
		НоваяСтрока.Телефон = ПолучитьЗначениеПоИмени(ЭлементЗаказ,"phone");
		НоваяСтрока.КонтактныйТелефон = ПолучитьЗначениеПоИмени(ЭлементЗаказ,"cell_phone");
		НоваяСтрока.Skype = ПолучитьЗначениеПоИмени(ЭлементЗаказ,"skype");
		НоваяСтрока.Icq = ПолучитьЗначениеПоИмени(ЭлементЗаказ,"icq");
		
		//ЛВГ+++
		НоваяСтрока.ПодразделениеКомпании = ПолучитьЗначениеПоИмени(ЭлементЗаказ,"partner_id");
		//ЛВГ---
		
		//Признаком того что клиент юр лицо, является наличие essential в ветке
		//Получим данные по компании и грузополучателе
		ЭлементыОрганизации = ЭлементЗаказ.ПолучитьЭлементыПоИмени("essential");
		КоличествоЭлементов = ЭлементыОрганизации.Количество();
		СвойАдресДоставки = Ложь;
		Если КоличествоЭлементов > 0 Тогда
			Для Каждого ЭлементEssential Из ЭлементыОрганизации Цикл
				Если ЭлементEssential.РодительскийУзел.ИмяУзла = "customer" Тогда
					//Наименование организации
					НоваяСтрока.Компания = ПолучитьЗначениеПоИмени(ЭлементEssential,"company_name");					
					//ИНН
					НоваяСтрока.ИНН = ПолучитьЗначениеПоИмени(ЭлементEssential,"inn");
					//КПП
					НоваяСтрока.КПП = ПолучитьЗначениеПоИмени(ЭлементEssential,"kpp");
					//Тип компании
					НоваяСтрока.ТипКомпании = ПолучитьЗначениеПоИмени(ЭлементEssential,"company_type");					
					//Банк
					НоваяСтрока.Банк = ПолучитьЗначениеПоИмени(ЭлементEssential,"bank");
					//БИК
					НоваяСтрока.БИК = ПолучитьЗначениеПоИмени(ЭлементEssential,"bik");
					//Город банка
					НоваяСтрока.ГородБанка = ПолучитьЗначениеПоИмени(ЭлементEssential,"city");
					//Номер счета
					НоваяСтрока.НомерСчета = ПолучитьЗначениеПоИмени(ЭлементEssential,"loro_account");
					
					//ЛВГ+++
					НоваяСтрока.ЦБКонтрагента = ПолучитьЗначениеПоИмени(ЭлементEssential,"code_1c");
					//ЛВГ---
				ИначеЕсли ЭлементEssential.РодительскийУзел.ИмяУзла = "order" Тогда
					//Наименование грузополучателя
					НоваяСтрока.Грузополучатель = ПолучитьЗначениеПоИмени(ЭлементEssential,"company_name");
					//ИНН грузополучателя
					НоваяСтрока.ГрузополучательИНН = ПолучитьЗначениеПоИмени(ЭлементEssential,"inn");
					//КПП грузополучателя
					НоваяСтрока.ГрузополучательКПП = ПолучитьЗначениеПоИмени(ЭлементEssential,"kpp");
					//Тип компании грузополучателя
					НоваяСтрока.ГрузополучательТип = ПолучитьЗначениеПоИмени(ЭлементEssential,"company_type");					
					//Банк грузополучателя
					НоваяСтрока.ГрузополучательБанк = ПолучитьЗначениеПоИмени(ЭлементEssential,"bank");
					//БИК грузополучателя
					НоваяСтрока.ГрузополучательБИК = ПолучитьЗначениеПоИмени(ЭлементEssential,"bik");
					//Город банка грузополучателя
					НоваяСтрока.ГрузополучательГородБанка = ПолучитьЗначениеПоИмени(ЭлементEssential,"city");
					//Номер счета грузополучателя
					НоваяСтрока.ГрузополучательНомерСчета = ПолучитьЗначениеПоИмени(ЭлементEssential,"loro_account");
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли;
		
		//Получим данные официального адреса компании
		ЭлементыОфАдреса = ЭлементЗаказ.ПолучитьЭлементыПоИмени("official_address");
		КоличествоЭлементов = ЭлементыОфАдреса.Количество();
		Если КоличествоЭлементов > 0 Тогда
			Для Каждого ЭлементOfficialAddress Из ЭлементыОфАдреса Цикл
				//Страна
				НоваяСтрока.ЮрСтрана = ПолучитьЗначениеПоИмени(ЭлементOfficialAddress,"country");					
				//Регион
				НоваяСтрока.ЮрРегион = ПолучитьЗначениеПоИмени(ЭлементOfficialAddress,"region");
				//Город
				НоваяСтрока.ЮрГород = ПолучитьЗначениеПоИмени(ЭлементOfficialAddress,"city");
				//Улица
				НоваяСтрока.ЮрУлица = ПолучитьЗначениеПоИмени(ЭлементOfficialAddress,"street");					
				//Дом
				НоваяСтрока.ЮрДом = ПолучитьЗначениеПоИмени(ЭлементOfficialAddress,"house");
				//Корпус
				НоваяСтрока.ЮрКорпус = ПолучитьЗначениеПоИмени(ЭлементOfficialAddress,"korpus");
				//Квартира
				НоваяСтрока.ЮрКвартира = ПолучитьЗначениеПоИмени(ЭлементOfficialAddress,"flat");
			КонецЦикла;
		КонецЕсли;
		
		//получим факт адрес и адрес доставки
		ЭлементыАдресов = ЭлементЗаказ.ПолучитьЭлементыПоИмени("delivery_address");
		КоличествоЭлементов = ЭлементыАдресов.Количество();
		Если КоличествоЭлементов > 0 Тогда
			Для Каждого ЭлементDeliveryAddress Из ЭлементыАдресов Цикл
				Если ЭлементDeliveryAddress.РодительскийУзел.ИмяУзла = "customer" Тогда
					//Страна
					НоваяСтрока.ФактСтрана = ПолучитьЗначениеПоИмени(ЭлементDeliveryAddress,"country");					
					//Регион
					НоваяСтрока.ФактРегион = ПолучитьЗначениеПоИмени(ЭлементDeliveryAddress,"region");
					//Город
					НоваяСтрока.ФактГород = ПолучитьЗначениеПоИмени(ЭлементDeliveryAddress,"city");
					//Улица
					НоваяСтрока.ФактУлица = ПолучитьЗначениеПоИмени(ЭлементDeliveryAddress,"street");					
					//Дом
					НоваяСтрока.ФактДом = ПолучитьЗначениеПоИмени(ЭлементDeliveryAddress,"house");
					//Корпус
					НоваяСтрока.ФактКорпус = ПолучитьЗначениеПоИмени(ЭлементDeliveryAddress,"korpus");
					//Квартира
					НоваяСтрока.ФактКвартира = ПолучитьЗначениеПоИмени(ЭлементDeliveryAddress,"flat");
				ИначеЕсли ЭлементDeliveryAddress.РодительскийУзел.ИмяУзла = "order" Тогда
					//Страна
					НоваяСтрока.ГрузополучательСтрана = ПолучитьЗначениеПоИмени(ЭлементDeliveryAddress,"country");					
					//Регион
					НоваяСтрока.ГрузополучательРегион = ПолучитьЗначениеПоИмени(ЭлементDeliveryAddress,"region");
					//Город
					НоваяСтрока.ГрузополучательГород = ПолучитьЗначениеПоИмени(ЭлементDeliveryAddress,"city");
					//Улица
					НоваяСтрока.ГрузополучательУлица = ПолучитьЗначениеПоИмени(ЭлементDeliveryAddress,"street");					
					//Дом
					НоваяСтрока.ГрузополучательДом = ПолучитьЗначениеПоИмени(ЭлементDeliveryAddress,"house");
					//Корпус
					НоваяСтрока.ГрузополучательКорпус = ПолучитьЗначениеПоИмени(ЭлементDeliveryAddress,"korpus");
					//Квартира
					НоваяСтрока.ГрузополучательКвартира = ПолучитьЗначениеПоИмени(ЭлементDeliveryAddress,"flat");
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//Получим товары из заказа
		Товары = Новый ТаблицаЗначений;
		Товары.Колонки.Добавить("IDСайта");
		Товары.Колонки.Добавить("Артикул", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(20)));
		Товары.Колонки.Добавить("НаименованиеПроизводителя", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(100)));
		Товары.Колонки.Добавить("ТоварНаименование");
		Товары.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10)));
		Товары.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)));
		Товары.Колонки.Добавить("ЗакупочнаяЦена", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)));
		Товары.Колонки.Добавить("ПоставщикНаименование");
		Товары.Колонки.Добавить("ПоставщикИНН");
		Товары.Колонки.Добавить("СрокПоставкиВСтроке", Новый ОписаниеТипов("Дата"));
		//ЛВг+++
		Товары.Колонки.Добавить("_ЛВГ_КодПрайсЛиста", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(8)));
		Товары.Колонки.Добавить("_ЛВГ_СрокПоставкиЧисло");
		Товары.Колонки.Добавить("АвиаПеревозка", Новый ОписаниеТипов("Булево"));
		
		Товары.Колонки.Добавить("_ЛВГ_НаличиеПоЗапросу");
		Товары.Колонки.Добавить("_ЛВГ_МинСуммаЗаказа");
		Товары.Колонки.Добавить("_ЛВГ_Партия");
		Товары.Колонки.Добавить("_ЛВГ_Партия_Дата");
		//ЛВГ---		
		
		СписокЭлементовТовары = ЭлементЗаказ.ПолучитьЭлементыПоИмени("order_item");
		ОтказСоздания = Ложь;
		Для Каждого ЭлементТовары Из СписокЭлементовТовары Цикл
			НоваяСтрокаТовары = Товары.Добавить();
			НоваяСтрокаТовары.IDСайта = ПолучитьЗначениеПоИмени(ЭлементТовары,"id_1c");
			НоваяСтрокаТовары.Артикул = ПолучитьЗначениеПоИмени(ЭлементТовары,"oem");
			НоваяСтрокаТовары.НаименованиеПроизводителя = ПолучитьЗначениеПоИмени(ЭлементТовары,"make_name");
			НоваяСтрокаТовары.ТоварНаименование = ПолучитьЗначениеПоИмени(ЭлементТовары,"detail_name");
			НоваяСтрокаТовары.Количество = ПолучитьЗначениеПоИмени(ЭлементТовары,"qnt");
			НоваяСтрокаТовары.Цена = ПолучитьЗначениеПоИмени(ЭлементТовары,"cost");
			НоваяСтрокаТовары.ЗакупочнаяЦена = ПолучитьЗначениеПоИмени(ЭлементТовары,"first_cost");
			НоваяСтрокаТовары.ПоставщикНаименование = ПолучитьЗначениеПоИмени(ЭлементТовары,"supplier");
			НоваяСтрокаТовары.ПоставщикИНН = ПолучитьЗначениеПоИмени(ЭлементТовары,"supplier_inn");
			СрокПоставкиВСтроке = ПолучитьЗначениеПоИмени(ЭлементТовары,"delivery_date");
			Если ЗначениеЗаполнено(СрокПоставкиВСтроке) Тогда
				КолДнейПоставки = Число(СрокПоставкиВСтроке);
				НоваяСтрокаТовары.СрокПоставкиВСтроке = НоваяСтрока.ДатаХраненияЗаказаНаСайте + 60*60*24*КолДнейПоставки;
			Иначе
				НоваяСтрокаТовары.СрокПоставкиВСтроке = НоваяСтрока.ДатаХраненияЗаказаНаСайте;
			КонецЕсли;
			//ЛВГ+++
			НоваяСтрокаТовары._ЛВГ_КодПрайсЛиста = ПолучитьЗначениеПоИмени(ЭлементТовары,"price_code1c");
			НоваяСтрокаТовары._ЛВГ_СрокПоставкиЧисло = ПолучитьЗначениеПоИмени(ЭлементТовары,"srok");
			ПризнакАвиа = ПолучитьЗначениеПоИмени(ЭлементТовары,"is_fly");
			НоваяСтрокаТовары.АвиаПеревозка = ?(ПризнакАвиа = "",Ложь, Истина);
			
			НаличиеПоЗапросу = ПолучитьЗначениеПоИмени(ЭлементТовары,"query_stock");
			НоваяСтрокаТовары._ЛВГ_НаличиеПоЗапросу = ?(НаличиеПоЗапросу = "",Ложь, Истина);
			
			МинСуммаЗаказа = ПолучитьЗначениеПоИмени(ЭлементТовары,"min_sum");
			Если МинСуммаЗаказа <> "" Тогда
				НоваяСтрокаТовары._ЛВГ_МинСуммаЗаказа = МинСуммаЗаказа;
			КонецЕсли;
			
			НоваяСтрокаТовары._ЛВГ_Партия = ПолучитьЗначениеПоИмени(ЭлементТовары,"receipt_number");
			НоваяСтрокаТовары._ЛВГ_Партия_Дата = ПолучитьЗначениеПоИмени(ЭлементТовары,"receipt_date");
			//ЛВГ---
			
		КонецЦикла;
		Если ОтказСоздания Тогда
			Прервать;
		КонецЕсли; 
		НоваяСтрока.Товары = Товары;
	КонецЦикла; 
	
	УдалитьФайлы(ИмяВходящегоФайла);
	
	СоздатьЗаказы(ТаблицаШапкиЗаказов);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПолучитьЗначениеПоИмени(ЭлементDom, ИмяПараметра)
	РезультатВозврата = "";
	Элемент = ЭлементDom.ПолучитьЭлементыПоИмени(ИмяПараметра);
	КоличествоЭлементов = Элемент.Количество();
	Если КоличествоЭлементов > 0 Тогда
		ПервыйДочерний = Элемент[0].ПервыйДочерний;
		Если ПервыйДочерний <> Неопределено Тогда
			РезультатВозврата = СокрЛП(ПервыйДочерний.Данные);
		КонецЕсли;
	КонецЕсли;
	Возврат РезультатВозврата;
КонецФункции

Процедура СоздатьЗаказы(ТаблицаШапкиЗаказов)
	//НастройкаОбмена = Справочники.НастройкаОбменаССайтом_AlfaAvto1C_ru.НастройкаОбменаССайтом;
	
	СоздаватьНоменклатуру = Истина;//НастройкаОбмена.СоздоватьНоменклатуру;	
	СоздаватьКонтрагентов = Истина;//НастройкаОбмена.СоздаватьКонтрагентов;
	//СтатусПринятКОбработке = Справочники.СтатусыЗаказаПокупателя_AlfaAvto1C_ru.ПринятКОбработке;
	
	Для Каждого СтрокаЗаказ Из ТаблицаШапкиЗаказов Цикл
		//Если заказ уже есть, то делать ничего не будем
		Если ДокументСуществует(СтрокаЗаказ.Номер) Тогда
			Продолжить;
		КонецЕсли;
		НовыйЗаказССайта = Документы.ЗаказКлиента.СоздатьДокумент();
		НовыйЗаказССайта.ДополнительныеСвойства.Вставить("obmen",Истина);
		НовыйЗаказССайта.Дата = ТекущаяДата();
		//НовыйЗаказССайта.Номер = СтрокаЗаказ.Номер; 
		
		//  Начало Беляев В.Д. 20/02/2024
		НовыйЗаказССайта.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("НалоговыйНомер",СтрокаЗаказ.ЦБКонтрагента);
		Если Не ЗначениеЗаполнено(НовыйЗаказССайта.Контрагент) Тогда
			НовыйЗаказССайта.Партнер = Справочники.Партнеры.НеизвестныйПартнер;
		Иначе 
			НовыйЗаказССайта.Партнер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовыйЗаказССайта.Контрагент, "Партнер");
		КонецЕсли;
		НовыйЗаказССайта.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7726389728");
		НовыйЗаказССайта.Подразделение = Справочники.СтруктураПредприятия.НайтиПоКоду(СтрокаЗаказ.ПодразделениеКомпании);
		НовыйЗаказССайта.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
		НовыйЗаказССайта.ЦенаВключаетНДС = Истина;
		НовыйЗаказССайта.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		НовыйЗаказССайта.Склад = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовыйЗаказССайта.Подразделение,"ЕТС_Склад");
		НовыйЗаказССайта.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
		//НовыйЗаказССайта.СрокДействия = НовыйЗаказССайта.Дата + 3*86400;
		НовыйЗаказССайта.Статус = Перечисления.СтатусыЗаказовКлиентов.НеСогласован;
		НовыйЗаказССайта.Валюта = Константы.БазоваяВалютаПоУмолчанию.Получить();
		НовыйЗаказССайта.Договор = ПродажиСервер.ПолучитьДоговорПоУмолчанию(НовыйЗаказССайта, НовыйЗаказССайта.ХозяйственнаяОперация, НовыйЗаказССайта.Валюта);
		НовыйЗаказССайта.ЕТС_НомерЗаказаКлиентаНаСайте = СтрокаЗаказ.Номер;
		НовыйЗаказССайта.ЕТС_ДатаЗаказаНаСайте = СтрокаЗаказ.ДатаХраненияЗаказаНаСайте;
		НовыйЗаказССайта.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
		//НовыйЗаказССайта.ВариантУказанияСрокаПоставки = Перечисления.ВариантыСроковПоставкиКоммерческихПредложений.УказываетсяНаОпределеннуюДату;
		ПользовательИБ = Справочники.Пользователи.НайтиПоРеквизиту("ЕТС_Код",СтрокаЗаказ.Менеджер);
		Если НовыйЗаказССайта.Партнер <> Справочники.Партнеры.НеизвестныйПартнер Тогда
			НовыйЗаказССайта.КонтактноеЛицо = ПолучитьКонтактноеЛицо(СтрокаЗаказ, НовыйЗаказССайта.Партнер);
		КонецЕсли;
		Если Не (ПользовательИБ = Справочники.Пользователи.ПустаяСсылка() Или
				Справочники.Пользователи.НайтиПоРеквизиту("ЕТС_Код","").Наименование <> "<Не указан>") Тогда
			НовыйЗаказССайта.Менеджер = ПользовательИБ;
			Если НовыйЗаказССайта.Партнер <> Справочники.Партнеры.НеизвестныйПартнер Тогда
				ОсновнойМенеджерПартнера = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовыйЗаказССайта.Партнер,"ОсновнойМенеджер");
				Если ОсновнойМенеджерПартнера <> НовыйЗаказССайта.Менеджер Тогда
					КлиентОбъект = НовыйЗаказССайта.Партнер.ПолучитьОбъект();	
					КлиентОбъект.ОсновнойМенеджер = НовыйЗаказССайта.Менеджер;
				    КлиентОбъект.Записать();
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		
		ТЗ_Товары = СтрокаЗаказ.Товары.Скопировать(,"Артикул,Количество,Цена,_ЛВГ_КодПрайсЛиста,
													|НаименованиеПроизводителя,СрокПоставкиВСтроке,
													|АвиаПеревозка,ЗакупочнаяЦена");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТЗ_Товары.Артикул КАК Артикул,
			|	ТЗ_Товары.Количество КАК Количество,
			|	ТЗ_Товары.Цена КАК Цена,
			|	ТЗ_Товары.ЗакупочнаяЦена КАК ЗакупочнаяЦена,
			|	ТЗ_Товары.СрокПоставкиВСтроке КАК СрокПоставки,
			|	ТЗ_Товары.АвиаПеревозка КАК АвиаПеревозка,
			|	ТЗ_Товары._ЛВГ_КодПрайсЛиста КАК КодПрайсЛиста,
			|	ТЗ_Товары.НаименованиеПроизводителя КАК НаименованиеПроизводителя
			|ПОМЕСТИТЬ ТЗ
			|ИЗ
			|	&ТЗ_Товары КАК ТЗ_Товары
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(Номенклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
			|	ЕСТЬNULL(ВидыЦен.Ссылка, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) КАК ВидЦены,
			|	ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению) КАК ВариантОбеспечения,
			|	ТЗ.Количество КАК КоличествоУпаковок,
			|	ТЗ.Количество КАК Количество,
			|	ТЗ.Цена КАК Цена,
			|	ТЗ.ЗакупочнаяЦена КАК ЕТС_ЗакупочнаяЦена,
			|	ТЗ.СрокПоставки КАК СрокПоставки,
			|	ТЗ.АвиаПеревозка КАК ЕТС_АвиаПеревозка,
			|	ТЗ.Количество * ТЗ.Цена КАК Сумма,
			|	ТЗ.Количество * ТЗ.Цена КАК СуммаСНДС,
			|	&СтавкаНДС КАК СтавкаНДС,
			//|	ТЗ.Количество * ТЗ.Цена * 20 / 120 КАК СуммаНДС,
			|	ВЫБОР
			|		КОГДА ВидыЦен.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияВидовЦен.ИндивидуальныйДляПартнера)
			|			ТОГДА ЕСТЬNULL(СоглашенияСПоставщиками.СрокПоставки, 0) + ЕСТЬNULL(СпособыОбеспеченияПотребностей.СрокИсполненияЗаказа, 0)
			//|		КОГДА ВидыЦен.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияВидовЦен.ИндивидуальныйДляСклада)
			//|				И ВидыЦен.ЕТС_Склад = &Склад
			//|			ТОГДА 1
			|		КОГДА ВидыЦен.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияВидовЦен.ИндивидуальныйДляСклада)
			|				И Не ВидыЦен.ЕТС_Склад = &Склад
			|			ТОГДА ЕСТЬNULL(СпособыОбеспеченияПотребностей.СрокИсполненияЗаказа, 0)
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СрокПоставки1,
			|	ВЫБОР
			|		КОГДА ВидыЦен.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияВидовЦен.ИндивидуальныйДляПартнера)
			|			ТОГДА ВидыЦен.ЕТС_Партнер
			|		КОГДА ВидыЦен.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияВидовЦен.ИндивидуальныйДляСклада)
			|			ТОГДА ВидыЦен.ЕТС_Склад
			|	КОНЕЦ КАК ЕТС_Поставщик,
			|	ВЫБОР
			|		КОГДА ВидыЦен.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияВидовЦен.ИндивидуальныйДляСклада)
			|			ТОГДА ВидыЦен.ЕТС_Склад
			|	КОНЕЦ КАК Склад,
			|	ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, ЕСТЬNULL(СпособыОбеспеченияПотребностей.СрокИсполненияЗаказа, 0)) КАК ДатаОтгрузки
			//Для удобства отладки дополнительные поля
			//|	,СоглашенияСПоставщиками.Ссылка КАК ЕТС_СоглашениеСПоставщиком,
			//|	ВидыЦен.ЕТС_Склад КАК Склад,
			//|	СпособыОбеспеченияПотребностей.Ссылка КАК СпособОбеспечения,
			//|	СоглашенияСПоставщиками.Склад КАК СкладСоглашения,
			//|	СоглашенияСПоставщиками.СрокПоставки КАК СрокПоставкиСоглашения,
			//|	СпособыОбеспеченияПотребностей.СрокИсполненияЗаказа КАК СрокПоставкиОбеспечения
			|ИЗ
			|	ТЗ КАК ТЗ
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Производители КАК Производители
			|		ПО ТЗ.НаименованиеПроизводителя = Производители.Наименование
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
			|		ПО ТЗ.Артикул = Номенклатура.Артикул
			|			И (Номенклатура.Производитель = Производители.Ссылка)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСПоставщиками КАК СоглашенияСПоставщиками
			|			ПО ВидыЦен.ЕТС_СоглашениеСПоставщиком = СоглашенияСПоставщиками.Ссылка
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОбеспеченияПотребностей КАК СпособыОбеспеченияПотребностей
			|			ПО (ВЫБОР
			|					КОГДА ВидыЦен.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияВидовЦен.ИндивидуальныйДляПартнера)
			|							И СпособыОбеспеченияПотребностей.ТипОбеспечения = ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Перемещение)
			|							И СоглашенияСПоставщиками.Склад = СпособыОбеспеченияПотребностей.ИсточникОбеспеченияПотребностей
			|							И СпособыОбеспеченияПотребностей.Подразделение = &Подразделение
			|						ТОГДА ИСТИНА
			|					КОГДА ВидыЦен.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияВидовЦен.ИндивидуальныйДляСклада)
			|							И СпособыОбеспеченияПотребностей.ТипОбеспечения = ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Перемещение)
			|							И ВидыЦен.ЕТС_Склад = СпособыОбеспеченияПотребностей.ИсточникОбеспеченияПотребностей
			|							И СпособыОбеспеченияПотребностей.Подразделение = &Подразделение
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ ЛОЖЬ
			|				КОНЕЦ)
			|		ПО ТЗ.КодПрайсЛиста = ВидыЦен.ЕТС_КодПрайса";
		
		Запрос.УстановитьПараметр("ТЗ_Товары", ТЗ_Товары);
		Запрос.УстановитьПараметр("СтавкаНДС", Справочники.СтавкиНДС.НайтиПоРеквизиту("ПеречислениеСтавкаНДС", Перечисления.СтавкиНДС.НДС20));
		Запрос.УстановитьПараметр("Подразделение", НовыйЗаказССайта.Подразделение);
		Запрос.УстановитьПараметр("Склад", НовыйЗаказССайта.Склад);
		Запрос.УстановитьПараметр("ТекущаяДата", НовыйЗаказССайта.Дата);
		//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		//
		//НовыйЗаказССайта.Товары.Загрузить(РезультатЗапроса);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТЧТоварыНоваяСтрока = НовыйЗаказССайта.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(ТЧТоварыНоваяСтрока,Выборка);
			ТЧТоварыНоваяСтрока.СуммаНДС = Окр(Выборка.Сумма - 100 * Выборка.Сумма / (100 + 20), 2, РежимОкругления.Окр15как20);
		КонецЦикла;
		
		НовыйЗаказССайта.СуммаДокумента = НовыйЗаказССайта.Товары.Итог("Сумма");
		
		//  Конец Беляев В.Д. 20/02/2024
		
		////Если за контрагентом закреплен куратор, то пропишем его в качестве менеджера
		//Запрос = Новый Запрос;
		//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		//|	Кураторы.Куратор
		//|ИЗ
		//|	РегистрСведений.Кураторы КАК Кураторы
		//|ГДЕ
		//|	Кураторы.Контрагент = &Контрагент";
		//Запрос.УстановитьПараметр("Контрагент", НовыйЗаказССайта.Контрагент);
		//РезультатЗапроса = Запрос.Выполнить();
		//Выборка = РезультатЗапроса.Выбрать();
		//Пока Выборка.Следующий() Цикл
		//	НовыйЗаказССайта.Менеджер = Выборка.Куратор;
		//КонецЦикла;  
		 
		//ТЧТовары = НовыйЗаказССайта.Товары;
		//Для Каждого СтрокаТовара Из СтрокаЗаказ.Товары Цикл
		//	НоваяСтрокаТовар = ТЧТовары.Добавить();
		//	ЗаполнитьЗначенияСвойств(НоваяСтрокаТовар, СтрокаТовара);
		//	НоваяСтрокаТовар.СуммаВсего = НоваяСтрокаТовар.Цена * НоваяСтрокаТовар.Количество;
		//	НоваяСтрокаТовар.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		//	НоваяСтрокаТовар.Поставщик = ПолучитьПоставщика(НоваяСтрокаТовар,СоздаватьКонтрагентов);
		//	
		//	//ЛВГ+++
		//	НоваяСтрокаТовар.СрокПоставкиВСтроке = НовыйЗаказССайта.Дата+(СтрокаТовара._ЛВГ_СрокПоставкиЧисло * 86400);
		//	
		//	Прайс_лист = Справочники.ПрайсЛистыКонтрагентов.НайтиПоКоду(СтрокаТовара._ЛВГ_КодПрайсЛиста);
		//	НоваяСтрокаТовар._ЛВГ_Price_id = Прайс_лист.Ссылка;
		//	НоваяСтрокаТовар._ЛВГ_Псевдоним = Прайс_лист.Владелец;
		//	НоваяСтрокаТовар._ЛВГ_НаименованиеПрайса = Прайс_лист._ЛВГ_НазваниеССайта;
		//	
		//	Если ЗначениеЗаполнено(СтрокаТовара._ЛВГ_Партия) Тогда
		//		Поступление = Документы.ПоступлениеТоваров.НайтиПоНомеру(СтрокаТовара._ЛВГ_Партия, СтрокаТовара._ЛВГ_Партия_Дата);
		//		НоваяСтрокаТовар._ЛВГ_Price_id = Поступление.Ссылка;
		//	КонецЕсли;	
		//	//ЛВГ---			
		//	
		//КонецЦикла; 
		//ЗаполнитьНоменклатуру(ТЧТовары,СоздаватьНоменклатуру);
		//НовыйЗаказССайта.ТипЦен = НастройкаОбмена.ТипЦен;
		//НовыйЗаказССайта.ТипЦенЗакупка = НастройкаОбмена.ТипЦенЗакупка;
		Попытка
			НовыйЗаказССайта.Записать(РежимЗаписиДокумента.Запись);
			Если НовыйЗаказССайта.Партнер = Справочники.Партнеры.НеизвестныйПартнер Тогда
				НаборЗаписей = РегистрыСведений.ЕТС_ЗагрузкаССайтаКонтрагенты.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Заказ.Установить(НовыйЗаказССайта.Ссылка);
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Заказ = НовыйЗаказССайта.Ссылка;
				НоваяЗапись.Наименование = СтрокаЗаказ.Компания;
				НоваяЗапись.ИНН = СтрокаЗаказ.ИНН;
				НоваяЗапись.КПП = СтрокаЗаказ.КПП;
				НоваяЗапись.Телефон = СтрокаЗаказ.Телефон;
				НаборЗаписей.Записать();
			КонецЕсли;
			//ЗаказДляВыгрузкиНаСайт(НовыйЗаказССайта.Ссылка);
			//УстановитьСтатусы(СтатусПринятКОбработке, НовыйЗаказССайта.Ссылка, Неопределено);
		Исключение
		    Сообщить(ОписаниеОшибки());
			Продолжить;
		КонецПопытки;
		//Прервать;
	КонецЦикла; 
КонецПроцедуры

Функция ДокументСуществует(Номер)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.ЕТС_НомерЗаказаКлиентаНаСайте ПОДОБНО &Номер";
	
	Запрос.УстановитьПараметр("Номер", Номер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();

КонецФункции // ДокументСуществует()

Функция ПолучитьКонтактноеЛицо(ДанныеЗаказа, Клиент) Экспорт 
	
	Адрес = ДанныеЗаказа.Email;
	Фамилия = ДанныеЗаказа.Фамилия;
	Имя = ДанныеЗаказа.Имя;
	Отчество = ДанныеЗаказа.Отчество;
	Телефон = ДанныеЗаказа.Телефон;
	Роль = Справочники.РолиКонтактныхЛицПартнеров.НайтиПоНаименованию("Оформление заказа на сайте");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактныеЛицаПартнеровРолиКонтактногоЛица.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров.РолиКонтактногоЛица КАК КонтактныеЛицаПартнеровРолиКонтактногоЛица
	|ГДЕ
	|	КонтактныеЛицаПартнеровРолиКонтактногоЛица.РольКонтактногоЛица = &РольКонтактногоЛица
	|	И КонтактныеЛицаПартнеровРолиКонтактногоЛица.Ссылка.ДатаПрекращенияСвязи = ДАТАВРЕМЯ(1, 1, 1)
	|	И КонтактныеЛицаПартнеровРолиКонтактногоЛица.Ссылка.Владелец = &Партнер
	|	И КонтактныеЛицаПартнеровРолиКонтактногоЛица.Ссылка.Наименование = &Адрес";
	
	Запрос.УстановитьПараметр("Партнер", Клиент);
	Запрос.УстановитьПараметр("РольКонтактногоЛица", Роль);
	Запрос.УстановитьПараметр("Адрес", Адрес);
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Менеджер = Рез.Ссылка;
	Иначе
		об = Справочники.КонтактныеЛицаПартнеров.СоздатьЭлемент();
		об.Владелец = Клиент;
		об.Наименование = Адрес;
		об.ДолжностьПоВизитке = СокрЛП(Фамилия)+" "+СокрЛП(Имя)+" "+СокрЛП(Отчество)+" "+СокрЛП(Телефон);
		стр = об.РолиКонтактногоЛица.Добавить();
		стр.РольКонтактногоЛица = Роль;
		об.Записать();  
		Менеджер = об.Ссылка;
	КонецЕсли;
	
	Возврат Менеджер;
	
КонецФункции // ПолучитьКонтактноеЛицо()
